/*Задание 1.

Напишите программу, которая работала бы следующим образом: в prompt вводится значение. С помощью унарного плюса (арифметический оператор) необходимо преобразовать его в число, затем проверить с помощью typeof, принадлежит ли оно к множеству Number.
Если это число, то вывести в консоль чётное оно или нечётное.
Если передано не число, выведите: «Упс, кажется, вы ошиблись».
*NaN, хоть и относится к типу Number, числом не является. Добавьте отдельную проверку для этого значения.*/ 

function Task1(){
    let enterNum = +prompt("Введите число");
    console.log(enterNum)
    if (typeof enterNum == 'number' && !isNaN(enterNum)){
        if (enterNum % 2 == 0) {
            console.log(enterNum + ' - чётное')
        } else {
            console.log(enterNum + ' - нечётное')
        }
    } else {
        console.log('Упс вы ошиблись!')
    }
}


Task1();